Revit 2020 API
AdvancedWood Members
The AdvancedWood type exposes the following members.
Properties
Name | Description
WoodCurlyDistortionEnable
 The property labeled "Enable distortion for wood secondary curly highlight" from the "PrismWood" schema.
WoodCurlyDistortionMap
 The property labeled "The 2D fiber distortion map (NO degamma op)" from the "PrismWood" schema.
WoodCurlyDistortionScale
 The property labeled "The scale of distortion for secondary curly highlight" from the "PrismWood" schema.
WoodDiffuseLobeWeight
 The property labeled "Weight of diffuse lobe" from the "PrismWood" schema.
WoodDiffusePerlinEnable
 The property labeled "Use perlin function for diffuse albedo" from the "PrismWood" schema.
WoodDiffusePerlinProf
 The property labeled "Profile for diffuse albedo perlin noise" from the "PrismWood" schema.
WoodDiffusePerlinScaleZ
 The property labeled "Anisotropic pos-z scale for diffuse albedo perlin" from the "PrismWood" schema.
WoodEarlyColor
 The property labeled "Earlywood color" from the "PrismWood" schema.
WoodEarlycolorPerlinEnable
 The property labeled "Use perlin noise for earlywood color" from the "PrismWood" schema.
WoodEarlycolorPerlinProf
 The property labeled "Profile for earlywood color perlin noise" from the "PrismWood" schema.
WoodEarlywoodSharpness
 The property labeled "Percentage of pure earlywood" from the "PrismWood" schema.
WoodFiberCosineEnable
 The property labeled "Use cosine function for wood fiber" from the "PrismWood" schema.
WoodFiberCosineProf
 The property labeled "Profile for fiber cosine function" from the "PrismWood" schema.
WoodFiberPerlinEnable
 The property labeled "Use perlin noise for wood fiber" from the "PrismWood" schema.
WoodFiberPerlinProf
 The property labeled "Profile for fiber perlin noise" from the "PrismWood" schema.
WoodFiberPerlinScaleZ
 The property labeled "Anisotropic pos-z scale for fiber perlin" from the "PrismWood" schema.
WoodFiberRoughness
 The property labeled "Roughness for secondary highlight" from the "PrismWood" schema.
WoodGrooveRoughness
 The property labeled "Roughness for surface groove area" from the "PrismWood" schema.
WoodGrowthPerlinEnable
 The property labeled "Use perlin noise for ring growth" from the "PrismWood" schema.
WoodGrowthPerlinProf
 The property labeled "Profile for growth perlin noise" from the "PrismWood" schema.
WoodLatecolorPerlinEnable
 The property labeled "Use perlin noise for latewood color" from the "PrismWood" schema.
WoodLatecolorPerlinProf
 The property labeled "Profile for latewood color perlin noise" from the "PrismWood" schema.
WoodLateColorPower
 The property labeled "Power to compute latewood color" from the "PrismWood" schema.
WoodLatewoodBumpDepth
 The property labeled "Depth (cm) of the latewood bump" from the "PrismWood" schema.
WoodLatewoodRatio
 The property labeled "Percentage of latewood in each ring" from the "PrismWood" schema.
WoodLatewoodSharpness
 The property labeled "Percentage of pure latewood" from the "PrismWood" schema.
WoodManualLateColor
 The property labeled "Manual latewood color" from the "PrismWood" schema.
WoodPoreCellDim
 The property labeled "Dim (cm) of cell containing one pore" from the "PrismWood" schema.
WoodPoreColorPower
 The property labeled "Power to compute pore color" from the "PrismWood" schema.
WoodPoreDepth
 The property labeled "Bump depth variation (cm) for pores" from the "PrismWood" schema.
WoodPoreRadius
 The property labeled "Radius (cm) of the impact circle of each pore" from the "PrismWood" schema.
WoodPoreType
 The property labeled "Pore type" from the "PrismWood" schema.
WoodRayColorPower
 The property labeled "Power to compute ray color" from the "PrismWood" schema.
WoodRayEllipseRadiusX
 The property labeled "Radius (cm) along the longer axis of ray ellipse" from the "PrismWood" schema.
WoodRayEllipseZ2x
 The property labeled "Ratio between two radii of ray ellipse" from the "PrismWood" schema.
WoodRayNumSlices
 The property labeled "Number of slices in xy plane" from the "PrismWood" schema.
WoodRaySegLengthZ
 The property labeled "Length (cm) of z segment containing one ray" from the "PrismWood" schema.
WoodRingThickness
 The property labeled "Thickness (cm) of yearly growth ring" from the "PrismWood" schema.
WoodSecondaryColorPower
 The property labeled "Power to compute secondary highlight color" from the "PrismWood" schema.
WoodSecondaryPerlinEnable
 The property labeled "Use perlin noise for secondary highlight" from the "PrismWood" schema.
WoodSecondaryPerlinProf
 The property labeled "Profile for secondary highlight perlin noise" from the "PrismWood" schema.
WoodSecondaryPerlinScaleZ
 The property labeled "Anisotropic pos-z scale for secondary highlight perlin" from the "PrismWood" schema.
WoodUseGrooveRoughness
 The property labeled "Use additional groove roughness" from the "PrismWood" schema.
WoodUseLatewoodBump
 The property labeled "Use latewood bump" from the "PrismWood" schema.
WoodUseManualLateColor
 The property labeled "Use manual latewood color" from the "PrismWood" schema.
WoodUsePores
 The property labeled "Use pores feature" from the "PrismWood" schema.
WoodUseRays
 The property labeled "Use rays feature" from the "PrismWood" schema.
See Also
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace